fellpower/Modulus-Firmware/firmware/s3-bridge/sdkconfig.defaults
# ESP32-S3 ESP-NOW → UART bridge for grblHAL
CONFIG_IDF_TARGET="esp32s3"

# Field build — perf + minimal log noise (boot MAC via printf in espnow_link)
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# CPU / flash
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_OCT_FLASH=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Disable brownout detector — WiFi/ESP-NOW init briefly spikes current
CONFIG_ESP32S3_BROWNOUT_DET=n

# WiFi — only needed for ESP-NOW (no TCP stack required)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# Keep radio always-on; power save adds up to 100 ms latency to ESP-NOW
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# Disable IPv6 to save RAM
CONFIG_LWIP_IPV6=n

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# NVS for persistent settings
CONFIG_NVS_ENCRYPTION=n

# Keep a post-mortem crash image in the existing coredump partition. `diag`
# reports its flash address/size so a field unit can be diagnosed afterwards.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=16
CONFIG_ESP_COREDUMP_LOGS=n
CONFIG_ESP_COREDUMP_STACK_SIZE=1792

# The Modulus/DevKit profile exposes UART0 through its USB-UART bridge. This
# keeps diagnostics available on boards whose USB socket is not native USB.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Default board when NVS has no `board` key. Runtime: USB shell `board mini1|xiao`
CONFIG_S3_BRIDGE_BOARD_MINI1=y
